/**********************************
包含头文件
**********************************/
#include "key.h"


/**********************************
变量定义
**********************************/
uint8_t chiclet_keyboard_num = 0;				//键值变量
uint8_t key_bz;


/**********************************
函数定义
**********************************/
/****
*******独立按键扫描函数
*******返回值：键值
*****/
uint8_t Chiclet_Keyboard_Scan(void)
{
	if(K1==1 && K2==1 && K3==1 && K4==1 && K5==1 && K6==1 && K7==1) key_bz=1;
	
	if(K1==0 && key_bz==1)						//按键K1为低电平
	{
		key_bz=0;
		return 1;												//返回键值
	}

	if(K2==0 && key_bz==1)						//按键K2为低电平
	{
		key_bz=0;
		return 2;												//返回键值
	}

	if(K3==0 && key_bz==1)						//按键K3为低电平
	{
		key_bz=0;
		return 3;												//返回键值
	}
	
	if(K4==0 && key_bz==1)						//按键K4为低电平
	{
		key_bz=0;
		return 4;												//返回键值
	}

	if(K5==0 && key_bz==1)						//按键K5为低电平
	{
		key_bz=0;
		return 5;												//返回键值
	}
	
	if(K6==0 && key_bz==1)						//按键K6为低电平
	{
		key_bz=0;
		return 6;												//返回键值
	}
	
	if(K7==0 && key_bz==1)						//按键K7为低电平
	{
		key_bz=0;
		return 7;												//返回键值
	}
	
	return 0;													//没有按键按下，返回0
}
